In [1]:
# Import libraries and dependencies
import pandas as pd

### Read CSV in as DataFrame

In [2]:
# Set the file path
file_path = '../Resources/people.csv'

# Read in the CSV as a DataFrame
people_csv = pd.read_csv(file_path)
people_csv.head()

,first_name,last_name,gender,age,company_name,address,city,phone1,phone2,email
0,Rufe,Eickhoff,M,54,Zieme and Sons,0 Summer Ridge Pass,Mizque,740-948-0089,177-453-4212,reickhoff0@last.fm
1,Berkie,Morson,M,20,Gibson and Sons,37963 Linden Crossing,Ouro Branco,168-714-9518,435-628-4078,bmorson1@homestead.com
2,Urbano,Polly,M,29,Brown-Dietrich,772 Crowley Court,Banff,126-409-5968,523-115-7431,upolly2@cdbaby.com
3,Alphonso,Bourley,M,29,Hansen-Russel,0 Graceland Avenue,Sabana Grande,583-906-8550,363-721-4939,abourley3@issuu.com
4,Munmro,Fenck,M,57,Jaskolski and D'Amore,7 Rowland Way,Pitai,141-960-7812,652-495-4816,mfenck4@mediafire.com

### Index Selection Using iloc

In [6]:
# Select the first row of the DataFrame
people_csv.iloc[0]

first_name                     Rufe
last_name                  Eickhoff
gender                            M
age                              54
company_name         Zieme and Sons
address         0 Summer Ridge Pass
city                         Mizque
phone1                 740-948-0089
phone2                 177-453-4212
email            reickhoff0@last.fm
Name: 0, dtype: object

In [7]:
# Select the second row of the DataFrame
people_csv.iloc[1]

first_name                      Berkie
last_name                       Morson
gender                               M
age                                 20
company_name           Gibson and Sons
address          37963 Linden Crossing
city                       Ouro Branco
phone1                    168-714-9518
phone2                    435-628-4078
email           bmorson1@homestead.com
Name: 1, dtype: object

In [8]:
# Select the first 10 rows of the DataFrame
people_csv.iloc[0:10]

,first_name,last_name,gender,age,company_name,address,city,phone1,phone2,email
0,Rufe,Eickhoff,M,54,Zieme and Sons,0 Summer Ridge Pass,Mizque,740-948-0089,177-453-4212,reickhoff0@last.fm
1,Berkie,Morson,M,20,Gibson and Sons,37963 Linden Crossing,Ouro Branco,168-714-9518,435-628-4078,bmorson1@homestead.com
2,Urbano,Polly,M,29,Brown-Dietrich,772 Crowley Court,Banff,126-409-5968,523-115-7431,upolly2@cdbaby.com
3,Alphonso,Bourley,M,29,Hansen-Russel,0 Graceland Avenue,Sabana Grande,583-906-8550,363-721-4939,abourley3@issuu.com
4,Munmro,Fenck,M,57,Jaskolski and D'Amore,7 Rowland Way,Pitai,141-960-7812,652-495-4816,mfenck4@mediafire.com
5,Colby,Chalfont,M,32,"Kunde, Herzog and Lindgren",98 Little Fleur Court,Liwale,395-153-7931,963-148-3533,cchalfont5@gov.uk
6,Erek,Simone,M,29,Botsford-Graham,441 Grover Parkway,Caoxi,742-302-7229,185-900-2437,esimone6@apple.com
7,Anett,Everly,F,49,"Hahn, Tremblay and Keebler",3226 Everett Center,Wangjiahe,383-619-6899,361-512-7416,aeverly7@jimdo.com
8,Howey,Cauldfield,M,23,Wyman LLC,72 Anzinger Street,Huancheng,350-164-4646,112-819-7882,hcauldfield8@nationalgeographic.com
9,Nate,Rowbottam,M,71,Bahringer Group,9 Glendale Alley,Río Bueno,660-856-1179,819-227-5451,nrowbottam9@yahoo.com

In [17]:
# Select the last row of the DataFrame
people_csv.iloc[-1]

first_name                  Helen-elizabeth
last_name                             McKew
gender                                    F
age                                      40
company_name    Wisozk, Mueller and Streich
address                  1 Northfield Alley
city                              Sijunjung
phone1                         922-121-7848
phone2                         649-108-4915
email                      hmckewdv@ibm.com
Name: 499, dtype: object

In [21]:
# Select the first column of the DataFrame
people_csv.iloc[0, 0]

first_name        Rufe
last_name     Eickhoff
gender               M
Name: 0, dtype: object

In [24]:
# Select the second column of the DataFrame, with all rows
people_csv.iloc[0:, 1]

0             reickhoff0@last.fm
1         bmorson1@homestead.com
2             upolly2@cdbaby.com
3            abourley3@issuu.com
4          mfenck4@mediafire.com
                 ...
495    ppatriadr@stumbleupon.com
496         pparrettds@cam.ac.uk
497         ejakemandt@prlog.org
498          cbarfootdu@about.me
499             hmckewdv@ibm.com
Name: email, Length: 500, dtype: object

In [ ]:
# Select the last column of the DataFrame, with all rows
people_csv.iloc[:, -1]

In [25]:
# Select the first two columns of the DataFrame, with all rows
people_csv.iloc[:, 0:2]

          first_name last_name
0               Rufe  Eickhoff
1             Berkie    Morson
2             Urbano     Polly
3           Alphonso   Bourley
4             Munmro     Fenck
..               ...       ...
495          Perrine    Patria
496             Perl   Parrett
497            Eleen   Jakeman
498           Crysta   Barfoot
499  Helen-elizabeth     McKew

[500 rows x 2 columns]

In [26]:
# Select the 1st, 5th, 8th, 22nd rows of the 1st 4th and 6th columns.
people_csv.iloc[
    [0,4,7,21],
    [0,3,5]
    ]

   first_name  age              address
0        Rufe   54  0 Summer Ridge Pass
4      Munmro   57        7 Rowland Way
7       Anett   49  3226 Everett Center
21      Loren   31   156 Eastlawn Trail

In [27]:
# Select the first 5 rows of the 3rd, 4th, and 5th columns of the DataFrame
people_csv.iloc[0:5,2:5]

  gender  age           company_name
0      M   54         Zieme and Sons
1      M   20        Gibson and Sons
2      M   29         Brown-Dietrich
3      M   29          Hansen-Russel
4      M   57  Jaskolski and D'Amore

### Assignment Using iLoc

In [ ]:
# Modify the 'first_name' column value of the first row
people_csv.iloc[0, people_csv.columns.get_loc('first_name')] = 'ASDF'
people_csv.head()

### Index Selection Using Loc

In [ ]:
# Indexing

In [ ]:
# Set the index as the 'first_name' column

In [ ]:
# Sort by the index

In [ ]:
# Select the row with the index 'Evan'

In [ ]:
# Slice the data to output a range of rows based on the index

In [ ]:
# Filter rows based on a column value conditional
people_csv.loc[people_csv['age'] == 39].head()

### Assignment Using Loc

In [ ]:
# Modify the 'first_name' value of the row with the index 'Yun'